# TODO:
#  Charles
#  Parallels

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "tomanthony/brews"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Top-like interface for container metrics
brew "ctop"
# Fish shell
 brew "fish"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fish shell
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU compiler collection
brew "gcc"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# iTermocil
brew "tomanthony/brews/itermocil"
# Syncthing
brew "syncthing"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Development environment
cask "vagrant"
# Zoom
cask "zoom"

cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "google-chrome"
cask "firefox"
cask "opera"
cask "cleanmymac"
cask "ilya-birman-typography-layout"
cask "karabiner-elements"
cask "loom"
cask "skype"
cask "transmission"
cask "audacity"
cask "vlc"
cask "arq"
cask "spectacle"

cask "docker"
cask "dashlane"
cask "lastpass"
cask "daisydisk"

cask "jetbrains-toolbox"
cask "fork"
cask "forklift"
cask "sequel-pro"
cask "iterm2"
cask "paw"

cask "virtualbox"
cask "parallels"

cask "little-snitch"
cask "micro-snitch"

mas "Be Focused Pro", id: 961632517
mas "Craft", id: 1487937127
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Monosnap", id: 540348655
mas "Skitch", id: 425955336
mas "Snap", id: 418073146
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
