# TODO:
#  Charles
#  Parallels

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "tomanthony/brews"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Collection of portable C++ source libraries
brew "boost"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Top-like interface for container metrics
brew "ctop"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Library and utilities for processing GIFs
brew "giflib"
# Generic library support script
brew "libtool"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# H.264/AVC encoder
brew "x264"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU compiler collection
brew "gcc"
# Postgres C API library
brew "libpq"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Implementation of the file(1) command
brew "libmagic"
# C and C++ client library to the memcached server
brew "libmemcached"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# Terminal-based visual file manager
brew "midnight-commander"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Flexible tool for responding to filesystem changes
brew "modd"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Framework for layout and rendering of i18n text
brew "pango"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt"
# Persistent key-value database, with built-in net interface
# TODO: Get rid of redis
brew "redis", restart_service: true
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Fast and powerful open source alternative to grep
brew "sift"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# User interface to the TELNET protocol
brew "telnet"
# Official documentation format of the GNU project
brew "texinfo"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Makes XML and HTML more amenable to classic UNIX text tools
brew "xml2"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
brew "tomanthony/brews/itermocil"

brew "syncthing"

# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Development environment
cask "vagrant"
# Zoom
cask "zoom"

cask "1password"
cask "alfred"
cask "bettertouchtool"
cask "google-chrome"
cask "firefox"
cask "opera"
cask "cleanmymac"
cask "ilya-birman-typography-layout"
cask "karabiner-elements"
cask "loom"
cask "skype"
cask "transmission"
cask "audacity"
cask "vlc"
cask "arq"
cask "spectacle"

cask "docker"
cask "dashlane"
cask "lastpass"
cask "daisydisk"

cask "jetbrains-toolbox"
cask "fork"
cask "forklift"
cask "sequel-pro"
cask "iterm2"
cask "paw"

mas "Be Focused Pro", id: 961632517
mas "Craft", id: 1487937127
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Monosnap", id: 540348655
mas "Skitch", id: 425955336
mas "Snap", id: 418073146
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
